# read design 
# read_verilog -setattr keep_hierarchy VSPCore.v
read_verilog VSPCore.v

# set attribute
setattr -set keep_hierarchy 1 CoreUnit
 
# elaborate design hierarchy
hierarchy -check -top VSPCore

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

#To make easy to parse for V2TT
flatten;

# mapping logic to gates.
abc -g gates,MUX

# cleanup
clean -purge

# write synthesized design
write_json vsp-core-ruby2.json
